jimmywong2003/nRF5-freeRTOS-BLE-Central-or-Peripheral-Example/ble_app_multiple_nus_c_freeRTOS/main.c
        *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}


#if NRF_LOG_ENABLED
/**@brief Thread for handling the logger.
 *
 * @details This thread is responsible for processing log entries if logs are deferred.
 *          Thread flushes all log entries and suspends. It is resumed by idle task hook.
 *
 * @param[in]   arg   Pointer used for passing some arbitrary information (context) from the
 *                    osThreadCreate() call to the thread.
 */
static void logger_thread(void * arg)
{
        UNUSED_PARAMETER(arg);

        while (1)
        {
                NRF_LOG_FLUSH();

                vTaskSuspend(NULL); // Suspend myself
        }
}
#endif //NRF_LOG_ENABLED

/**@brief A function which is hooked to idle task.
 * @note Idle hook must be enabled in FreeRTOS configuration (configUSE_IDLE_HOOK).
 */
void vApplicationIdleHook( void )
{
#if NRF_LOG_ENABLED
        vTaskResume(m_logger_thread);
#endif
}


/**@brief Function for initializing the clock.
 */
static void clock_init(void)
{
        ret_code_t err_code = nrf_drv_clock_init();
        APP_ERROR_CHECK(err_code);
}


/**@brief Function for application main entry.
 */
int main(void)
{
        bool erase_bonds;

        // Initialize modules.
        uart_init();
        log_init();
        clock_init();

        nrf_drv_clock_lfclk_request(NULL);
        APP_ERROR_CHECK(nrf_stack_guard_init());

        // Do not start any interrupt that uses system functions before system initialisation.
        // The best solution is to start the OS before any other initalisation.

#if NRF_LOG_ENABLED
        // Start execution.
        if (pdPASS != xTaskCreate(logger_thread, "LOGGER", 256, NULL, 1, &m_logger_thread))
        {
                APP_ERROR_HANDLER(NRF_ERROR_NO_MEM);
        }
#endif

        // Activate deep sleep mode.
        SCB->SCR |= SCB_SCR_SLEEPDEEP_Msk;

        // Configure and initialize the BLE stack.
        ble_stack_init();

        // Initialize modules.
        timers_init();
        buttons_leds_init(&erase_bonds);

        scan_init();
        gatt_init();
        db_discovery_init();

        nus_c_init();
        ble_conn_state_init();

        application_timers_start();

        // Create a FreeRTOS task for the BLE stack.
        // The task will run advertising_start() before entering its loop.
        nrf_sdh_freertos_init(scan_start, NULL);

        NRF_LOG_INFO("BLE Central NUS x 2 with FreeRTOS.");
        // Start FreeRTOS scheduler.
        vTaskStartScheduler();

        for (;;)
        {
                APP_ERROR_HANDLER(NRF_ERROR_FORBIDDEN);
        }
}
